backend/app/controllers/api/v1/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
        def logged_in_user
            if request.headers['Authorization']
                method, token = request.headers['Authorization'].split(' ')
                begin
                    payload, headers = JWT.decode(token, 'my_apps_secret')
                    current_user = User.find(payload['user_id'])