backend/app/controllers/api/v1/needs_controller.rb

    def index
        render json: Need.all
---
SELECT "needs".* FROM "needs"