backend/app/controllers/api/v1/needs_controller.rb

INSERT INTO "needs" ("shelter_id", "title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["shelter_id", 10], ["title", "fghjk"], ["description", ""], ["created_at", "2019-01-18 16:51:27.534205"], ["updated_at", "2019-01-18 16:51:27.534205"]]
---
    def create
        need = Need.create(need_params)

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def index
        shelter = Shelter.find(params[:shelter_id])

UPDATE "needs" SET "quantity_needed" = ?, "quantity_bought" = ?, "updated_at" = ? WHERE "needs"."id" = ?  [["quantity_needed", 39], ["quantity_bought", 4], ["updated_at", "2019-01-24 16:04:46.888289"], ["id", 33]]
---
    def update
        current_need.update(need_params)

DELETE FROM "needs" WHERE "needs"."id" = ?  [["id", 6]]
---
    def destroy
        current_need.destroy

SELECT  "needs".* FROM "needs" WHERE "needs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def define_current_need
        if params[:id]
            @current_need = Need.find(params[:id])