backend/app/controllers/api/v1/shelters_controller.rb

    def create
        shelter = Shelter.create(shelter_params)
---
INSERT INTO "shelters" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "alan"], ["user_id", 3], ["created_at", "2019-01-16 20:50:03.995852"], ["updated_at", "2019-01-16 20:50:03.995852"]]

    def index
        render json: Shelter.all, include: [:needs]
---
SELECT "needs".* FROM "needs" WHERE "needs"."shelter_id" = ?  [["shelter_id", 10]]
SELECT "shelters".* FROM "shelters"

    def update
        current_shelter.update(shelter_params)
---
UPDATE "shelters" SET "name" = ?, "description" = ?, "address" = ?, "phone" = ?, "updated_at" = ? WHERE "shelters"."id" = ?  [["name", ""], ["description", ""], ["address", ""], ["phone", ""], ["updated_at", "2019-01-24 16:38:30.331225"], ["id", 63]]

    def destroy
        current_shelter.destroy
---
DELETE FROM "shelters" WHERE "shelters"."id" = ?  [["id", 5]]

    def define_current_shelter
        if params[:id]
            @current_shelter = Shelter.find(params[:id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]