backend/app/controllers/api/v1/shelter_locations_controller.rb

SELECT "shelter_locations".* FROM "shelter_locations"
---
    def index
        render json: ShelterLocation.all